# FBXExportOptions Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FBXExportOptions Properties
FBXExportOptions Class See Also
---
The FBXExportOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LevelsOfDetailValue | The value of the levels of detail. |
| StopOnError | Whether export process should stop when a view fails to export. |
| UseLevelsOfDetail | True to use levels of detail, false otherwise. |
| WithoutBoundaryEdges | True to export without boundary edges, false otherwise. |

# See Also
FBXExportOptions Class
Autodesk.Revit.DB Namespace